01 - RedditHackerNewsStyleWebApp/raddit/app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("link_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_id", 1], ["body", "This is an awesome recipe."], ["user_id", 1], ["created_at", "2017-11-08 05:16:23.375309"], ["updated_at", "2017-11-08 05:16:23.375309"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save