04 - PinterestClone/pin_board/app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC
---
	def index
		@pins = Pin.all.order('created_at DESC')

INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "this is the thrid"], ["description", ";sldjfl;sdkfyyyy"], ["created_at", "2017-12-10 07:20:29.681450"], ["updated_at", "2017-12-10 07:20:29.681450"], ["user_id", 1]]
---
	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save

UPDATE "pins" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["image_file_name", "C3P0.JPG"], ["image_updated_at", "2017-12-10 09:25:39.453230"], ["updated_at", "2017-12-10 09:25:39.707309"], ["id", 3]]
---
	def update
		if @pin.update(pin_params)